#### Terraform Project Format dashy and Style 🖌`success`
#### Terraform Project Initialization dashy ⚙️`success`
#### Terraform Project Plan dashy 📖`success`
#### Terraform Project Validation dashy 🤖`success`

<details><summary>Show Project dashy Plan</summary>

```

Project dashy 
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch.develop will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "dashy"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch_protection.develop will be created
  + resource "github_branch_protection" "develop" {
      + allows_deletions        = false
      + allows_force_pushes     = true
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "develop"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false
    }

  # github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = (known after apply)
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.dashy will be created
  + resource "github_repository" "dashy" {
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "dashy"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vyrtualsynthese, Action: `pull_request`*